{
    "abstract": " <p>In a multi-armed bandit (MAB) problem, an online algorithm makes a sequence of choices. In each round it chooses from a time- invariant set of alternatives and receives the payoff associated with this alternative. While the case of small strategy sets is by now well-understood, a lot of recent work has focused on MAB problems with exponentially or infinitely large strategy sets, where one needs to assume extra structure in order to make the problem tractable. In particular, recent literature considered information on similarity between arms.</p> <p>We consider similarity information in the setting of <i>contextual bandits</i>, a natural extension of the basic MAB problem where before each round an algorithm is given the <i>context</i>---a hint about the payoffs in this round. Contextual bandits are directly motivated by placing advertisements on web pages, one of the crucial problems in sponsored search. A particularly simple way to represent similarity information in the contextual bandit setting is via a <i>similarity distance</i> between the context- arm pairs which bounds from above the difference between the respective expected payoffs.</p> <p>Prior work on contextual bandits with similarity uses â\u0080\u009cuniform\" partitions of the similarity space, so that each context-arm pair is approximated by the closest pair in the partition. Algorithms based on â\u0080\u009cuniform\" partitions disregard the structure of the payoffs and the context arrivals, which is potentially wasteful. We present algorithms that are based on <i>adaptive</i> partitions, and take advantage of \"benign\" payoffs and context arrivals without sacrificing the worst-case performance. The central idea is to maintain a finer partition in high-payoff regions of the similarity space and in popular regions of the context space. Our results apply to several other settings, e.g., MAB with constrained temporal change (Slivkins and Upfal, 2008) and sleeping bandits (Kleinberg et al., 2008a).</p>",
    "authors": [
        "Aleks",
        "rs Slivkins"
    ],
    "id": "slivkins14a",
    "issue": 73,
    "pages": [
        2533,
        2568
    ],
    "title": "Contextual Bandits with Similarity Information",
    "volume": 15,
    "year": 2014
}